app/views/doc_scheds/_form.html.erb

    <%= f.label :doctor_id %>
    <%= f.collection_select :doctor_id, Doctor.all, :id, :doc_name %><br>
---
SELECT "doctors".* FROM "doctors"