app/controllers/admin/doctors_controller.rb

SELECT "doctors".* FROM "doctors"
---
  def index
    @doctors = Doctor.all

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @doctor = Doctor.find(params[:id])