app/controllers/admin/patients_controller.rb

SELECT "patients".* FROM "patients"
---
  def index
    @patients = Patient.all

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @patient = Patient.find(params[:id])

INSERT INTO "patients" ("email", "password_digest", "first_name", "last_name", "birthday", "allergies") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @patient = Patient.new(patient_params)
    if @patient.valid?
      @patient.save

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @patient = Patient.find(params[:id])