app/views/patients/_table.html.erb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."patient_id" = ?  [["patient_id", 1]]
---
    <th>Doctor</th>
<% @patient.appointments.each do |appt| %>