app/views/patients/admin_show.html.erb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."patient_id" = ? AND (date >= '2019-09-25')  [["patient_id", 2]]
---
  </tr>
<% @patient.appointments.future.each do |appt| %>