app/views/patients/home.html.erb

    <th>Doctor</th>
<% @patient.appointments.each do |appt| %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."patient_id" = ?  [["patient_id", 1]]

<ul>
  <% @patient.patient_meds.each do |med| %>
---
SELECT "patient_meds".* FROM "patient_meds" WHERE "patient_meds"."patient_id" = ?  [["patient_id", 1]]