app/views/patients/show.html.erb

SELECT "patient_meds".* FROM "patient_meds" WHERE "patient_meds"."patient_id" = ?  [["patient_id", 1]]
---
  <ul>
  <% @patient.patient_meds.each do |med| %>