app/views/admin/patients/show.html.erb

  </tr>
<% @patient.appointments.future.each do |appt| %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."patient_id" = ? AND (date >= '2019-09-23')  [["patient_id", 1]]