app/views/doctors/show.html.erb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."doctor_id" = ? AND (date >= '2019-09-23') AND (patient_id IS NULL)  [["doctor_id", 1]]
---
<ul>
  <% @doctor.appointments.each do |appt| %>