app/controllers/application_controller.rb

  def set_patient
    @patient = Patient.find(session[:patient_id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_doctor
    @doctor = Doctor.find(session[:doctor_id])
---
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]