app/controllers/appointments_controller.rb

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 52], ["LIMIT", 1]]
---
  def show
    @appointment = Appointment.find(params[:id])

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 51], ["LIMIT", 1]]
---
  def edit
    @appointment = Appointment.find(params[:id])

SELECT "appointments".* FROM "appointments" WHERE (date < '2019-09-30') AND (patient_id IS NULL)
UPDATE "appointments" SET "patient_id" = ? WHERE "appointments"."id" = ?  [["patient_id", 1], ["id", 133]]
---
  def update
    @appointment = Appointment.find(params[:id])
    @appointment.update(appointment_params)

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 49], ["LIMIT", 1]]
UPDATE "appointments" SET "patient_id" = ? WHERE "appointments"."id" = ?  [["patient_id", 2], ["id", 49]]
---
  def add_patient
    @appointment = Appointment.find(params[:appointment_id])
    @appointment.patient = @patient
    @appointment.save

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 67], ["LIMIT", 1]]
DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 68]]
---
  def destroy
    @appointment = Appointment.find(params[:appointment_id])
    @appointment.destroy

SELECT "appointments".* FROM "appointments" WHERE (date < '2019-09-25') AND (patient_id IS NULL)
DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 68]]
---
  def destroy_past
    @appts = Appointments.all.past.available
    @appts.destroy_all