app/controllers/appointments_controller.rb

  def index
    if params[:doctor_id]
      @doctor = Doctor.find(params[:doctor_id])
---
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def new
    @doctor = Doctor.find(params[:doctor_id])
---
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @doctor = Doctor.find(params[:doctor_id])
---
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def destroy_past
    @appts = Appointment.all.past.available
    @appts.destroy_all
---
DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 66]]

  def add_patient
    @appointment = Appointment.find(params[:appointment_id])
    @appointment.patient = @patient
    @appointment.save
---
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 131], ["LIMIT", 1]]
UPDATE "appointments" SET "patient_id" = ? WHERE "appointments"."id" = ?  [["patient_id", 1], ["id", 131]]

  def destroy
    @appointment = Appointment.find(params[:id])
    @appointment.destroy
---
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 139], ["LIMIT", 1]]
DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 139]]