app/controllers/doc_scheds_controller.rb

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    raise params
    @sched = DocSched.new
    @doctor = Doctor.find(params[:doctor_id])