app/controllers/doc_scheds_controller.rb

  def create
    @sched = DocSched.new(sched_params)
    if @sched.valid?
      @sched.save
---
INSERT INTO "doc_scheds" ("date", "shift_start", "shift_end", "doctor_id") VALUES (?, ?, ?, ?)  [["date", "2019-09-16"], ["shift_start", "2000-01-01 13:00:00"], ["shift_end", "2000-01-01 15:00:00"], ["doctor_id", 1]]