app/controllers/doctor_sessions_controller.rb

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."username" = ? LIMIT ?  [["username", "drwho"], ["LIMIT", 1]]
---
  def create
    if @doctor = Doctor.find_by(params[:username]) && @doctor.authenticate(params[:password])