app/controllers/doctors_controller.rb

SELECT "doctors".* FROM "doctors"
---
  def index
    if is_patient?
      current_patient
      @doctors = Doctor.all

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @doctor = Doctor.find(params[:id])

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "doctors" SET "updated_at" = ? WHERE "doctors"."id" = ?  [["updated_at", "2019-09-26 15:44:19.897110"], ["id", 3]]
---
  def update
    @doctor = Doctor.find(params[:id])
    @doctor.update(doc_params)

INSERT INTO "doctors" ("username", "password_digest", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @doctor = Doctor.new(doc_params)
    if @doctor.valid?
      @doctor.save

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @doctor = Doctor.find(params[:id])