app/controllers/medications_controller.rb

  def index
    if params[:search]
      @medications = Medication.where('treats LIKE ?', "%#{params[:search]}%")
    else
      @medications = Medication.all
---
SELECT "medications".* FROM "medications" WHERE (treats LIKE '%Depression%')
SELECT "medications".* FROM "medications"

  def create
    @medication = Medication.create(med_params)
---
INSERT INTO "medications" ("name", "treats") VALUES (?, ?)  [["name", "False Ideas"], ["treats", "Depression"]]

  def show
    @medication= Medication.find(params[:id])
---
SELECT  "medications".* FROM "medications" WHERE "medications"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @medication = Medication.find(params[:id])
---
SELECT  "medications".* FROM "medications" WHERE "medications"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @medication = Medication.find(params[:id])
    @medication.destroy
---
SELECT  "medications".* FROM "medications" WHERE "medications"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "medications" WHERE "medications"."id" = ?  [["id", 1]]