app/controllers/patient_meds_controller.rb

SELECT  "patient_meds".* FROM "patient_meds" WHERE "patient_meds"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
DELETE FROM "patient_meds" WHERE "patient_meds"."id" = ?  [["id", 22]]
---
  def destroy
    @med = PatientMed.find(params[:format])
    @patient = @med.patient
    @med.destroy