app/controllers/patients_controller.rb

  def index
    if @doctor.admin
      @patients = Patient.all
      if params[:search]
        @patients = @patients.where('last_name LIKE ?', "%#{params[:search]}%")
      end
    else
      @patients = @doctor.patients.uniq
      if params[:search]
        @patients = @patients.where('last_name LIKE ?', "%#{params[:search]}%")
---
SELECT "patients".* FROM "patients" WHERE (last_name LIKE '%Doe%')
SELECT "patients".* FROM "patients" INNER JOIN "appointments" ON "patients"."id" = "appointments"."patient_id" WHERE "appointments"."doctor_id" = ?  [["doctor_id", 1]]

  def show
    if @doctor.admin
      @patient = Patient.find(params[:id])
      @appointments = Appointment.future.available
      render :admin_show
    else
      @patient = Patient.find(params[:id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @patient = Patient.find(params[:id])
    if @patient.update(patient_params)
      redirect_to doctor_home_path(@doctor)
    else
      @appointment = Appointment.find(params[:patient][:appointments_attributes][:id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "patients" SET "first_name" = ?, "allergies" = ? WHERE "patients"."id" = ?  [["first_name", "Jeremy"], ["allergies", "Gluten"], ["id", 1]]
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 142], ["LIMIT", 1]]

  def edit
    @patient = Patient.find(params[:id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]