app/controllers/patient_sessions_controller.rb

  def create
    if auth_hash = request.env["omniauth.auth"]
      if @patient = Patient.find_by(email: auth_hash[:info][:email])
        session[:patient_id] = @patient.id
      else
        @patient = Patient.create(email: auth_hash[:info][:email], password: SecureRandom.hex)
        @patient.first_name = Patient.facebook_first(auth_hash[:info][:name])
        @patient.last_name = Patient.facebook_last(auth_hash[:info][:name])
        @patient.save
      end
      session[:patient_id] = @patient.id
      redirect_to patient_home_path(@patient)
    elsif @patient = Patient.find_by(email: params[:patient][:email])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."email" = ? LIMIT ?  [["email", "jandmhough@gmail.com"], ["LIMIT", 1]]
INSERT INTO "patients" ("email", "password_digest") VALUES (?, ?)  [["email", "jandmhough@gmail.com"], ["password_digest", "$2a$12$6yblXup7WM54CXaBDTWyAeGS3h7u8plbzmZk3t3Tx6HkRwGiDh1qG"]]
SELECT  "patients".* FROM "patients" WHERE "patients"."email" = ? LIMIT ?  [["email", "joe@sample.com"], ["LIMIT", 1]]
UPDATE "patients" SET "first_name" = ?, "last_name" = ? WHERE "patients"."id" = ?  [["first_name", "Morgan"], ["last_name", "Hough"], ["id", 4]]