app/models/doc_sched.rb

  def make_appointments
    time = self.shift_start
    while time < self.shift_end do
      Appointment.create(doctor: self.doctor, date: self.date, time: time)
---
INSERT INTO "appointments" ("doctor_id", "date", "time") VALUES (?, ?, ?)  [["doctor_id", 1], ["date", "2019-09-27"], ["time", "2000-01-01 05:00:00"]]