app/models/patient.rb

  def appointments_attributes=(appointment)
    @appointment = Appointment.find(appointment[:id])
    @appointment.update(appointment)
---
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 50], ["LIMIT", 1]]
UPDATE "appointments" SET "height" = ?, "weight" = ?, "bmi" = ?, "temp" = ?, "systolic" = ?, "diastolic" = ?, "heart_rate" = ?, "rr" = ?, "visit_reason" = ?, "history" = ?, "neuro" = ?, "heent" = ?, "cardiac" = ?, "respiratory" = ?, "skin" = ?, "musculoskeletal" = ?, "psychosocial" = ?, "therapies" = ?, "tests_ordered" = ?, "follow_up" = ? WHERE "appointments"."id" = ?

  def patient_meds_attributes=(medications)

    medications.each do |k,v|
      if @patient_med = PatientMed.find_by(id: v[:id])
        @patient_med.update(v)
      else
        v[:patient_id] = self.id
        @patient_med = PatientMed.create(v)
---
SELECT  "patient_meds".* FROM "patient_meds" WHERE "patient_meds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "patient_meds" SET "medication_id" = ?, "dosage" = ? WHERE "patient_meds"."id" = ?  [["medication_id", 5], ["dosage", "100 mg"], ["id", 1]]
INSERT INTO "patient_meds" ("patient_id", "medication_id", "dosage", "instructions") VALUES (?, ?, ?, ?)  [["patient_id", 2], ["medication_id", 3], ["dosage", "30 mg tablets"], ["instructions", "Hello"]]