app/views/appointments/edit.html.erb

      <td> Medication: </td>
      <td> <%= med.options_from_collection :medication_id, Medication.all, :id, :name %></td>
---
SELECT "medications".* FROM "medications"